// Методы Math.round и toFixed, согласно документации, 
// округляют до ближайшего целого числа: 0..4 округляется в меньшую сторону, 
// тогда как 5..9 в большую сторону.

// Например:

alert( 1.35.toFixed(20) ); // 1.4

// Но почему в примере ниже 6.35 округляется до 6.3?

alert( 6.35.toFixed(1) ); // 6.3

// Как правильно округлить 6.35?

// Честно? Сначала только замелит потерю точности, окурглив до 20 знаков
// Оказывает решается проблема путем умножения и разделения на 10

alert( (6.35 * 10).toFixed(20) ); // 63.50000000000000000000

alert( Math.round(6.35 * 10) / 10 ); // 6.35 -> 63.5 -> 64(rounded) -> 6.4